// 2. Напишіть умовну конструкцію if, що перевіряє, чи знаходиться значення ціни товару між 1000 та 1900 включно. Результат виводити в консоль
// Перетворити рішення задач з попередньої домашки на функції. 
// Всі вхідні дані що були у змінних передавайте в якості параметрів функції.

const myFunction = (lower_price, top_price, price_value) => {
  if (price_value >= lower_price && price_value <= top_price) {
    return "Значення ціни товару знаходиться між 1000 та 1900";
  } else {
    return "Значення ціни товару не знаходиться між 1000 та 1900";
  }
};

myFunction(1000, 1900, 400);
let result = myFunction(1000, 1900, 400);
console.log(result);
