// 7.  За допомогою switch реалізуйте обчислення виразу, передаючи у switch, як параметр, символ математичної операції.
//     Математичні операції для обчислення: "+", "-", "*", "/".
//     Результат виводити в консоль.
// Перетворити рішення задач з попередньої домашки на функції. 
// Всі вхідні дані що були у змінних передавайте в якості параметрів функції.

const myFunction = (a, b, operator) => {
  switch (operator) {
    case "+":
      return a + b;
    case "-":
      return a - b;
    case "*":
      return a * b;
    case "/":
      return a / b;
    default:
      return "невідома операція";
  }
};

myFunction(10, 24, "/");
let result = myFunction(10, 24, "/");
console.log(result);
