// 3. Напишіть конструкцію if, щоб перевіряє, чи значення ціни товару не знаходиться між 1000 та 1900 включно.
// Реалізуйте два варіанти, один з оператором НЕ !, а інший без цього оператора.
// Результат виводити в консоль.
// Перетворити рішення задач з попередньої домашки на функції.
// Всі вхідні дані що були у змінних передавайте в якості параметрів функції.

const myFunction1 = (lower_price1, top_price1, price_value1) => {
  if (price_value1 <= lower_price1 && price_value1 >= top_price1) {
    return "Значення ціни товару не знаходиться між 1000 та 1900 включно";
  } else {
    return "Значення ціни товару знаходиться між 1000 та 1900 включно";
  }
};

myFunction1(1000, 1900, 1500);
let result1 = myFunction1(1000, 1900, 1500);
console.log(result1);

// ------------------------------------------------------------------------------------------

const myFunction2 = (lower_price2, top_price2, price_value2) => {
  if (!(price_value2 >= lower_price2 && price_value2 <= top_price2)) {
    return "Значення ціни товару не знаходиться між 1000 та 1900 включно(2)";
  } else {
    return "Значення ціни товару знаходиться між 1000 та 1900 включно(2)";
  }
};

myFunction2(1000, 1900, 1500);
let result2 = myFunction2(1000, 1900, 1500);
console.log(result2);
