// 5.  Задано 3 числа (a, b, c), які не рівні між собою.
// Визначити середнє мід цими трьома числами
// (не середнє арифметичне значення, а яке з трьох заданих чисел среднє за значенням) використовуючи оператор if-else.
// Використати вкладені оператори if
// Результат виводити в консоль.
// Перетворити рішення задач з попередньої домашки на функції. 
// Всі вхідні дані що були у змінних передавайте в якості параметрів функції.

const myFunction = (a, b, c) => {
  if (a > b) {
    if (a < c) {
      return "Медіана: a";
    } else if (b > c) {
      return "Медіана: b";
    } else {
      return "Медіана: c";
    }
  } else {
    if (a > c) {
      return "Медіана: a";
    } else if (b < c) {
      return "Медіана: b";
    } else {
      return "Медіана: c";
    }
  }
};

myFunction(40, 80, 1);
let result = myFunction(40, 80, 1);
console.log(result);
